Ran Apply for dir: `.` workspace: `production`

**Apply Error**
<details><summary>Show Output</summary>

```
running "/usr/bin/terraform apply -input=false -no-color" in "/home/ubuntu/.atlantis/repos/1995navinkumar/terraform/11/production": exit status 1
Running apply in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/sknk/production/runs/run-to6Hy6gWJTdmGnme

Waiting for the plan to start...

Terraform v1.6.1
on linux_amd64
Initializing plugins and modules...
module.kubernetes.module.nginx.helm_release.nginx: Refreshing state... [id=nginx]
module.kubernetes.module.traefik.helm_release.traefik: Refreshing state... [id=traefik]
module.kubernetes.module.nginx.helm_release.nginx: Drift detected (delete)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.kubernetes.module.traefik.helm_release.traefik will be destroyed
  - resource "helm_release" "traefik" {
      - atomic                     = false -> null
      - chart                      = "traefik" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "traefik" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "v2.10.4"
              - chart       = "traefik"
              - name        = "traefik"
              - namespace   = "default"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - hostNetwork = true
                    }
                )
              - version     = "24.0.0"
            },
        ] -> null
      - name                       = "traefik" -> null
      - namespace                  = "default" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://traefik.github.io/charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "failed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<-EOT
                hostNetwork: true
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "24.0.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.kubernetes.module.whoami.helm_release.whoami will be created
  + resource "helm_release" "whoami" {
      + atomic                     = false
      + chart                      = "./"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "whoami"
      + namespace                  = "default"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = (known after apply)
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Error: Cannot confirm apply due to -input=false. Please handle run confirmation in the UI.

```
</details>